Ran Plan for dir: `github-examples` workspace: `default`

<details><summary>Show Output</summary>

```diff
Acquiring state lock. This may take a few moments...
github_team.read-it-all: Refreshing state... [id=4422891]
github_repository.terraform-created: Refreshing state... [id=terraform-examples]
github_team_membership.jonico-member-read-it-all: Refreshing state... [id=4422891:jonico]
github_team_repository.read-it-all_team_repo["octocat-sandbox"]: Refreshing state... [id=4422891:octocat-sandbox]
github_team_repository.read-it-all_team_repo["runner"]: Refreshing state... [id=4422891:runner]
github_team_repository.read-it-all_team_repo["daimler-actions"]: Refreshing state... [id=4422891:daimler-actions]
github_team_repository.read-it-all_team_repo["man-test-actions"]: Refreshing state... [id=4422891:man-test-actions]
github_team_repository.read-it-all_team_repo["signing-commit-tests"]: Refreshing state... [id=4422891:signing-commit-tests]
github_team_repository.read-it-all_team_repo["template-bookstore-demo"]: Refreshing state... [id=4422891:template-bookstore-demo]
github_team_repository.read-it-all_team_repo["awesomeactions"]: Refreshing state... [id=4422891:awesomeactions]
github_team_repository.read-it-all_team_repo["terraform-test"]: Refreshing state... [id=4422891:terraform-test]
github_team_repository.read-it-all_team_repo["msft-demo"]: Refreshing state... [id=4422891:msft-demo]
github_team_repository.read-it-all_team_repo["bookstore-demo-bootstrap"]: Refreshing state... [id=4422891:bookstore-demo-bootstrap]
github_team_repository.read-it-all_team_repo["reading-time-app"]: Refreshing state... [id=4422891:reading-time-app]
github_team_repository.read-it-all_team_repo["pr-required"]: Refreshing state... [id=4422891:pr-required]
github_team_repository.read-it-all_team_repo["otto-awesome"]: Refreshing state... [id=4422891:otto-awesome]
github_team_repository.read-it-all_team_repo["issue-body-parser-action"]: Refreshing state... [id=4422891:issue-body-parser-action]
github_team_repository.read-it-all_team_repo["set-env-test"]: Refreshing state... [id=4422891:set-env-test]
github_team_repository.read-it-all_team_repo["openhack-example"]: Refreshing state... [id=4422891:openhack-example]
github_team_repository.read-it-all_team_repo["reading-time-app-codespaces"]: Refreshing state... [id=4422891:reading-time-app-codespaces]
github_team_repository.read-it-all_team_repo["awesome-mirror"]: Refreshing state... [id=4422891:awesome-mirror]
github_team_repository.read-it-all_team_repo["diego-awesome"]: Refreshing state... [id=4422891:diego-awesome]
github_team_repository.read-it-all_team_repo["reading-time-mirror"]: Refreshing state... [id=4422891:reading-time-mirror]
github_team_repository.read-it-all_team_repo["jonico-sandbox.github.io"]: Refreshing state... [id=4422891:jonico-sandbox.github.io]
github_team_repository.read-it-all_team_repo["openhack-awesome"]: Refreshing state... [id=4422891:openhack-awesome]
github_team_repository.read-it-all_team_repo["ShinyApp"]: Refreshing state... [id=4422891:ShinyApp]
github_team_repository.read-it-all_team_repo["vw-china"]: Refreshing state... [id=4422891:vw-china]
github_team_repository.read-it-all_team_repo["daimler-bootstrap"]: Refreshing state... [id=4422891:daimler-bootstrap]
github_team_repository.read-it-all_team_repo["libzengithub-ghsa-jv3f-852g-jmm3"]: Refreshing state... [id=4422891:libzengithub-ghsa-jv3f-852g-jmm3]
github_repository_collaborator.jessla-collaborator-admin-terraform-created: Refreshing state... [id=terraform-examples:jessla]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_repository.terraform-created must be replaced
-/+ resource "github_repository" "terraform-created" {
      ~ default_branch         = "master" -> (known after apply)
      ~ description            = "Repo created by terraform with Shiny App template" -> "Repo created by terraform"
      ~ etag                   = "W/\"3b1eee38a324bd8a96790e9b6c9c0f7e1679046753164b61145cb60d283eae40\"" -> (known after apply)
      ~ full_name              = "jonico-sandbox/terraform-examples" -> (known after apply)
      ~ git_clone_url          = "git://github.com/jonico-sandbox/terraform-examples.git" -> (known after apply)
      - has_downloads          = false -> null
      - has_issues             = false -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      ~ html_url               = "https://github.com/jonico-sandbox/terraform-examples" -> (known after apply)
      ~ http_clone_url         = "https://github.com/jonico-sandbox/terraform-examples.git" -> (known after apply)
      ~ id                     = "terraform-examples" -> (known after apply)
      - is_template            = false -> null
      ~ name                   = "terraform-examples" -> "terraform-created" # forces replacement
      ~ node_id                = "MDEwOlJlcG9zaXRvcnkzMjkwNjE0MTU=" -> (known after apply)
      ~ private                = true -> (known after apply)
      ~ repo_id                = 329061415 -> (known after apply)
      ~ ssh_clone_url          = "git@github.com:jonico-sandbox/terraform-examples.git" -> (known after apply)
      ~ svn_url                = "https://github.com/jonico-sandbox/terraform-examples" -> (known after apply)
      - topics                 = [] -> null
      - vulnerability_alerts   = false -> null
        # (6 unchanged attributes hidden)

      ~ template {
          ~ owner      = "jonico-sandbox" -> "jonico"
            # (1 unchanged attribute hidden)
        }
    }

  # github_repository_collaborator.jessla-collaborator-admin-terraform-created must be replaced
-/+ resource "github_repository_collaborator" "jessla-collaborator-admin-terraform-created" {
      ~ id            = "terraform-examples:jessla" -> (known after apply)
      + invitation_id = (known after apply)
      ~ repository    = "terraform-examples" -> "terraform-created" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # github_team_repository.read-it-all_team_repo["terraform-examples"] will be created
+ resource "github_team_repository" "read-it-all_team_repo" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "pull"
      + repository = "terraform-examples"
      + team_id    = "4422891"
    }

Plan: 3 to add, 0 to change, 2 to destroy.
Releasing state lock. This may take a few moments...

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d github-examples`
* :put_litter_in_its_place: To **delete** this plan click [here](https://2f1b6065ff08.ngrok.io/lock?id=jonico%252Fatlantis-example%252Fgithub-examples%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d github-examples`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
